[[0,
"12:30, 21/09",
"The attack is launched",
"al-Shabaab militants pull up outside the mall’s main entrance in a car, and stride towards the building's entrance firing automatic rifles at other cars around them and throwing grenades at innocent passers-by. 5 minutes afterwards, two of the attackers make their way to the rooftop parking garage. Upon their arrival, they open fire on adults and children taking part in a children’s cooking competition, before entering the mall through a rear exit. Ruhila Adatia-Sood, a famous Kenyan radio presenter, was shot dead at the scene alongside other victims.",
true
],

[0,
"12:40, 21/09",
"The basement carpark and inside the mall",
"In the basement car park underneath the mall, the attackers set up a \"command and control centre\" in an unidentified vehicle and the Ghanaian poet Kofi Awoonor is believed to have been shot here at the same time. Meanwhile inside the mall, Muslims were allowed to leave before the shooting started with shoppers allegedly asked to name the Prophet's mother to prove their identity. Witnesses reported that non-Muslims were shot at point-blank range.",
false
],

[1,
"13:10, 21/09",
"First armed response",
"Plainclothes police officers from Nairobi's flying squad arrive at the scene but initially refused to enter. Meanwhile, armed volunteers from a neighbourhood watch scheme run by Kenyan-Indians in the nearby district of Parklands also arrive and enter the building with Kenya Red Cross secretary-general Abbas Gullet and Abdul Hajji, the son of former defence minister Mohamed Yussuf Hajji.",
true
],

[1,
"13:26, 21/09",
"Reuters report two injuries",
"A Reuters witness saw two wounded people stretchered out of the mall as panicked shoppers fled the building and armed police ducked behind vehicles outside.\"There's been shooting in there,\" said the man as he ran out of the Westgate shopping mall in the Westlands district.",
false
],

[2,
"14:30, 21/09",
"Attackers are spotted on the roof",
"Witnesses on the car park roof saw at least two men, who they believe to have been attackers, changing into casual clothes near the tent where the cooking competition was judged. At this point there was no police cordon and no screening process for survivors coming out of the mall. Intelligence officials believe that at least two attackers were able to escape in the confusion.",
true
],

[4,
"16:00, 21/09",
"Heavily armed police and the army arrive",
"Kenya’s equivalent of a SWAT team, a police reconnaissance unit known as the \"Recce group\", arrive at the mall. Wearing black body armour and helmets, armed with machine guns and trained for hostage and siege situations, they were the best-equipped to deal with the attackers, and were able to pin them down inside Nakumatt. The first Kenyan army units also arrived, and behind the scenes a power struggle was emerging between the police chief David Kimaiyo and the army head, Julius Karangi, over whose forces would take the lead. First to move in was the recce group, followed shortly afterwards by KDF soldiers.",
true
],

[5,
"17:30, 21/09",
"Friendly-fire incident",
"With no radio communications between army and police units, KDF soldiers opened fire on what they thought was an armed suspect – but who was in fact one of the commanders of the Recce group. The man died, and 3 police officers and 1 soldier were wounded in the exchange. After this all units were pulled out of the mall and for the next 2 hours the operation came to a standstill as heated arguments raged that went all the way to the office of President Kenyatta.",
true
],

[9,
"21:00, 21/09",
"al-Shabaab claims responsibility for attack",
"The Somali-based group tells Al Jazeera it is responsible for siege of Kenyan shopping centre that has left at least 30 dead and 50 injured. Source: Al Jazeera.",
true
],

[10,
"22:15, 21/09",
"Kenyan President Uhuru Kenyatta had close relatives among the dead",
"President Kenyatta said in a televised address that some of his family members were killed in the attack. The attacks sought to intimidate and divide the nation, he added, but \"we have overcome terrorist attacks before. We will defeat them again\".Source: ABC News.",
true
],

[11,
"23:00, 21/09",
"French government said two of its citizens were killed",
"The Elysee Palace said in a statement that two French citizens were among the victims. Source: ABC News.",
true
],

[14,
"02:00, 22/09",
"Canadian citizens killed and Americans injured",
"Canadian Prime Minister Stephen Harper said in a statement that two Canadians, including one diplomat, were among those killed in the attack. US Secretary of State John Kerry released a statement saying that several American citizens had been injured, but that there were no reports of any killed. The wife of a foreign service national working for the US Agency for International Development had died, though, he said. Source: ABC News",
true
],

[16,
"03:47, 22/09",
"UN condemns the attack",
"The UN Security Council released a statement that its members \"condemn in the strongest possible terms today's terrorist attack in Nairobi\". Source: ABC News",
true
],


[19,
"07:00, 22/09",
"Re-entry",
"Under the command of the police chief, a joint unit comprised of police and army made a first attempt to enter and take control of the ground floor of Nakumatt, where they believed the bulk of the militants were. They came under fire from a sniper on one of the upper floors and were forced to withdraw after at least two of their men were shot, one of them fatally. \"They have an arsenal in there,” said one of the soldiers involved in the operation\". Source: The Guardian",
true
],

[21,
"09:00, 22/09",
"Growing mass media presence",
"Hundreds of onlookers had now gathered on the high ground overlooking the Westgate mall. The police also had to deal with a growing media presence as news crews set up live points. Regular bursts of gunfire were heard throughout the morning, with one official saying that the operations were aimed at depleting the militants’ ammunition store. Source: The Guardian",
true
],

[24,
"11:55, 22/09",
"Official death count rises to 59",
"Interior Minister Joseph Ole Lenku announces that 59 people had been confirmed deadand at least 175 people had been injured. Ten to 15 attackers were still in the mall, and 1,000 people had been rescued so far, he said. Kenyan security forces were in control of the CCTV room and were monitoring the situation, he added. There were still some people inside the mall, and the situation remained a national security operation, he added. Source: Channel 4 News",
true
],

[26,
"14:00, 22/09",
"Three British nationals confirmed dead",
"Three Britons have been confirmed dead, and the number is likely to rise, officials said. Prime Minister David Cameron said that \"we should prepare ourselves for further bad news\" and condemned the \"despicable attack of appalling brutality\".Source: The Huffington Post.",
true
],

[29,
"16:50, 22/09",
"Israeli commandos enter the building",
"\"White\" military men, working in teams of three, were seen to enter the building carrying specialist rifles. They were later identified as Israeli commandos. The Kenyan recce group re-entered the mall, with some officers carrying rocket propelled grenade launchers. Over the next two hours two loud explosions were heard from inside.",
true
],

[29,
"17:30, 22/09",
"President Kenyatta speech",
"Kenya's president announces that security forces confronting militants in a Nairobi shopping mall had as good a chance \"as we can hope for\" of neutralising the attackers. \"The criminals are now located in one place within the building. With the professionals on site, I assure Kenyans that we have as good a chance to successfully neutralise the terrorists as we can hope for\", he said in an address.",
true
],

[31,
"18:45, 22/09",
"Military helicopters attempt to land of the roof",
"Two helicopters land on the roof in an apparent operation to retake the mall. A large explosion is heard.",
true
],

[43,
"06:45, 23/09",
"Military command centre is set up",
"The KDF's assurances that the siege was reaching a conclusion were shattered by a huge blast that shook the entire Westlands district, followed by bursts of gunfire. By now a command centre had been set up and a British team was present in the room, including officers from the Metropolitan police’s anti-terror unit along with Israeli officials.",
true
],

[49,
"13:25, 23/09",
"Four large blasts are heard",
"Four more large blasts – the loudest during the siege – were heard from inside Westgate and a column of black smoke climbed into the sky. Helicopters that had been hovering just over the roof the previous day began to circle higher overhead.",
true
],

[52,
"16:22, 23/09",
"CNN report 39 killed",
"Armed gunmen continue to face off with Kenyan police and soldiers inside the shopping mall, with 39 deaths reported so far. Two gunmen, including one who was detained after being shot, are also dead.",
false
],

[55,
"19:00, 23/09",
"Smoke blamed on the attackers",
"Kenyan officials say that the smoke is from terrorists setting mattresses on fire.",
true
],

[71,
"11:25, 24/09",
"CNN report most hostages freed and 68 deaths",
"Authorities appeared close to ending the deadly siege, where attackers are reported to have killed at least 68 people, injured 175, and are believed to still be holding about 10 people hostage.",
false
],

[72,
"12:30, 24/09",
"First amateur footage emerges",
"The first amateur footage of the rear of the shopping centre emerged, showing a vast crater in the rear third of the building. The rooftop car park area where much of the worst of the carnage took place had collapsed into the floors below. Officials first claimed that the militants had set off explosives and set fire to mattresses inside Nakumatt supermarket.",
true
],

[79,
"19:00, 24/09",
"Explosions and gunfire continue",
"Explosions and gunfire continued inside Westgate all day and was said to be coming from troops providing cover while bomb disposal teams removed booby traps.",
true
],

[80,
"20:00, 24/09",
"The siege ends",
"President Kenyatta declared, \"the operation is now over\" in a live televised address. He stated that \"the agents of terror, themselves craven wretches and lowly cowards, had the agenda of perpetrating grievous mayhem in our country, senselessly killing, maiming and traumatising harmless, innocent people\".",
true
]]























