[
[
[0,
"12:30PM, 21/09",
"The attack is launched",
"Source: The Guardian",
"al-Shabaab militants pull up outside the mall’s main entrance in a car, and stride towards the building's entrance firing assault rifles and throwing grenades at innocent passers-by. Soon afterwards, two of the attackers make their way to the rooftop parking garage and open fire on adults and children taking part in a cooking competition, before re-entering the mall. Ruhila Adatia-Sood, a famous Kenyan radio presenter, was shot dead at the scene alongside others.",
true
],

[0,
"12:40PM, 21/09",
"The first minutes of the attack",
"Source: The Guardian",
"In the basement car park, the attackers set up a \"command and control centre\" in an unidentified vehicle. Meanwhile inside the mall, Muslims were allowed to leave before the shooting started with shoppers allegedly asked to name the Prophet's mother to prove their identity. Witnesses reported that non-Muslims were shot at point-blank range.",
false
]
],

[
[1,
"1:10PM, 21/09",
"First armed response",
"Source: The Guardian",
"Plainclothes police officers from Nairobi's flying squad arrive at the scene but initially refuse to enter. Meanwhile, armed volunteers from a neighbourhood watch scheme run by Kenyan-Indians also arrive and enter the mall together with Kenya Red Cross secretary-general Abbas Gullet and Abdul Hajji, the son of former defence minister Mohamed Yussuf Hajji.",
true
],

[1,
"1:26PM, 21/09",
"First injuries reported",
"Source: Reuters",
"An eyewitness saw two wounded people being stretchered out of the mall as panicked shoppers fled the building and armed police ducked behind vehicles outside.\"There's been shooting in there,\" said the man as he ran out of the mall.",
false
]
],

[2,
"2:30PM, 21/09",
"Attackers are spotted on the roof",
"Source: The Guardian",
"Witnesses on the car park roof saw at least two men, believed to have been attackers, changing into casual clothes near the tent where the cooking competition had taken place. At this point there was still no police cordon or screening process for survivors coming out of the mall.",
true
],

[4,
"4:00PM, 21/09",
"Heavily armed police and army arrive",
"Source: The Guardian",
"A heavily armed police unit known as the GSU or  \"Recce group\", arrived at the mall. Wearing black body armour and trained for hostage situations, they were able to pin the attackers down inside the mall. The first Kenyan army units also arrived and behind the scenes a power struggle emerged between the police and army over whose forces would enter first. The Recce group entered first, followed by army soldiers.",
true
],

[5,
"5:30PM, 21/09",
"Friendly-fire incident",
"Source: The Guardian",
"With no radio communications between army and police units, soldiers accidently opened fire on what they thought was an armed suspect, but who was in fact one of the commanders of the Recce group. The man died, and three police officers and one soldier were also wounded in the exchange. All units were subsequently pulled out of the mall and the operation came to a standstill as heated arguments raged.",
true
],

[9,
"9:00PM, 21/09",
"al-Shabaab claims responsibility for attack",
"Source: Al Jazeera",
"The terrorist group al-Shabaab informed Al Jazeera it was responsible for the attack, which at the time of reporting had left at least 30 dead and 50 injured. It was carried out in \"retaliation for Kenyan military operations in Somalia\", the group stated.",
true
],

[10,
"10:15PM, 21/09",
"Kenyan President reveals death of family members",
"Source: ABC News",
"In a televised address, President Uhuru Kenyatta stated that a nephew and his fiancee were killed inside Westgate. He added that the attack sought to intimidate and divide the nation, but \"we have overcome terrorist attacks before. We will defeat them again\".",
true
],

[11,
"11:00PM, 21/09",
"French government states two of its citizens were killed",
"Source: ABC News",
"The Elysee Palace said in a statement that two French women were among the victims of the attack.",
true
],

[14,
"2:00AM, 22/09",
"Canadian citizens killed and Americans injured",
"Source: ABC News",
"The Canadian PM Stephen Harper said that two Canadians were killed in the attack. US Secretary of State John Kerry also claimed that several American citizens had been injured, but there were no reports of any killed. However, the wife of a foreign service national working for USAID had died.",
true
],

[16,
"3:47AM, 22/09",
"UN condemns the attack",
"Source: ABC News",
"The UN Security Council released a statement that its members \"condemn in the strongest possible terms today's terrorist attack in Nairobi\".",
true
],


[19,
"7:00AM, 22/09",
"Re-entry",
"Source: The Guardian",
"Under the command of the police chief, a joint unit comprised of police and army made a first attempt to enter and take control of the ground floor, where they believed most of the militants were. They came under fire from a sniper on one of the upper floors and were forced to withdraw after at least two of their men were shot, one of them fatally.",
true
],

[21,
"9:00AM, 22/09",
"Growing mass media presence",
"Source: The Guardian",
"Hundreds of onlookers had now gathered on the high ground overlooking the mall. The police also had to deal with a growing media presence as news crews set up live points. Regular bursts of gunfire were heard throughout the morning, with one official saying that the operations were aimed at depleting the militants’ ammunition store.",
true
],

[24,
"11:55AM, 22/09",
"Official death count rises to 59",
"Source: Channel 4 News",
"Interior Minister Joseph Ole Lenku announced that 59 people had died and at least 175 people were injured. Ten to 15 attackers were still in the mall and 1,000 people had been rescued so far, although some people remained inside. Kenyan security forces were also in control of the CCTV room and were monitoring the situation, he added.",
true
],

[26,
"2:00PM, 22/09",
"Three British nationals confirmed dead",
"Source: The Huffington Post",
"Three Britons have been confirmed dead, and the number is likely to rise, officials said. Prime Minister David Cameron added that \"we should prepare ourselves for further bad news\" and condemned the \"despicable attack of appalling brutality\".",
true
],

[29,
"5:30PM, 22/09",
"President Kenyatta gives an update",
"Source: Channel 4 News",
"The president announced that security forces inside the mall still had as good a chance \"as we can hope for\" of neutralising the attackers. He stated that \"the criminals are now located in one place within the building. With the professionals on site, I assure Kenyans that we have as good a chance to successfully neutralise the terrorists as we can hope for\".",
true
],

[31,
"6:45PM, 22/09",
"Helicopters attempt to land on the roof",
"Source: BBC News",
"Two military helicopters attempted to land on the roof in an apparent operation to breach the roof and retake the mall. This resulted in further fighting between security forces and the terrorists, and a large explosion followed.",
true
],

[43,
"6:45AM, 23/09",
"Military command centre is set up",
"Source: The Guardian",
"The army's assurances that the siege was reaching a conclusion were shattered by a huge blast that shook the entire area, followed by volleys of gunfire. By now a command centre had been set up and a British team was present in the room along with Israeli officials.",
true
],

[47,
"11:02AM, 23/09",
"Most hostages freed and death toll at 68",
"Source: CNN",
"Security forces appeared close to ending the deadly siege, which at this point had killed at least 68 people and injured 175. The terrorists were also believed to still have been holding about 10 people hostage. CNN claimed to have substantiated online rumours that several of the gunmen are Americans and Europeans of Somali origin.",
false
],

[49,
"1:25PM, 23/09",
"Four loud explosions are heard",
"Source: The Guardian",
"The loudest explosions during the siege rocked the Westlands neighborhood, and a large column of thick dark smoke was seen climbing into the sky. Helicopters that had been hovering just over the roof the previous day began to circle higher overhead.",
true
],

[51,
"2:56PM, 23/09",
"Smoke blamed on the attackers",
"Sources: BBC News, AFP",
"Kenya’s Interior Minister says that the plumes of smoke seen coming out of the shopping mall were from a fire started by the terrorists who set mattresses alight in a supermarket inside. Weakened by the fire, part of the mall’s rooftop car park collapsed around this time.",
true
],

[53,
"5:45PM, 23/09",
"Al-Shabab defends Nairobi attack",
"Source: Al Jazeera",
"The group’s military spokesman, Sheikh Abulaziz Abu Muscab, claimed that the group is defending \"the rights of the Somali people\" and that \"attacks like this will become common\" unless Kenya withdraws troops from Somalia.",
true
],

[59,
"11:24PM, 23/09",
"President Obama condemns the attack",
"Source: BBC News",
"US President Barack Obama called the attack a \"terrible outrage\" and said the United States is “standing with Kenya” and providing all the cooperation it can. Obama also offered \"whatever law enforcement support that is necessary\" to his Kenyan counterpart.",
true
],

[72,
"12:30PM, 24/09",
"First amateur footage emerges",
"Source: The Guardian",
"The first footage of the rear of the shopping mall emerged, showing a vast crater in the rear third of the building. The rooftop car park area where much of the worst of the carnage took place had collapsed into the floors below. Officials first claimed that the militants had set off explosives and set fire to mattresses inside the mall’s supermarket.",
true
],

[79,
"7:00PM, 24/09",
"Explosions and gunfire continue",
"Source: The Guardian",
"Over the course of the day explosions and gunfire continued inside Westgate and was said to be coming from soldiers providing cover while bomb disposal teams removed booby traps left by the terrorists.",
true
],

[80,
"8:00PM, 24/09",
"The siege ends",
"Source: BBC News",
"President Kenyatta declared \"the operation is now over\" in a live television address. He stated that \"the agents of terror, themselves craven wretches and lowly cowards, had the agenda of perpetrating grievous mayhem in our country, senselessly killing, maiming and traumatising harmless, innocent people\".",
true
]]